#### `terraform plan` Success
<details><summary>Show Output</summary>

```
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/foreign-language-reader/infrastructure/runs/run-Voxe7VSjPRrQYCJq

Waiting for the plan to start...

Terraform v0.14.3
Configuring remote state backend...
Initializing Terraform configuration...
module.infrastructure.tls_private_key.tls_private_key: Refreshing state... [id=96c5128d225c1725a7d5fda91c9f195dd1837181]
module.infrastructure.digitalocean_domain.main: Refreshing state... [id=foreignlanguagereader.com]
module.infrastructure.digitalocean_domain.fluentlabs: Refreshing state... [id=fluentlabs.io]
module.infrastructure.module.monitoring.random_password.fluent_elasticsearch_password: Refreshing state... [id=none]
module.infrastructure.module.api.random_password.application_secret: Refreshing state... [id=none]
module.infrastructure.module.api.random_password.elasticsearch_password: Refreshing state... [id=none]
module.infrastructure.module.content.random_password.elasticsearch_password: Refreshing state... [id=none]
module.infrastructure.module.content.random_password.truststore_password: Refreshing state... [id=none]
module.infrastructure.module.database.random_password.database_admin_password: Refreshing state... [id=none]
module.infrastructure.acme_certificate.certificate: Refreshing state... [id=5b26b697-bd46-8986-882e-8d464a869dcd]
module.infrastructure.module.api.random_password.truststore_password: Refreshing state... [id=none]
module.infrastructure.acme_registration.reg: Refreshing state... [id=https://acme-v02.api.letsencrypt.org/acme/acct/106949055]
module.infrastructure.acme_certificate.certificate_fluent_labs: Refreshing state... [id=1f925157-0a72-7ffc-0dc5-688f3f39570f]
module.infrastructure.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:165140526436:certificate/6470664d-0acf-4b67-93a9-8430119af2fa]
module.infrastructure.module.nginx_ingress.aws_route53_zone.main: Refreshing state... [id=Z06930519E1ERX06IWP1]
module.kubernetes.aws_iam_role.eks_cluster_role: Refreshing state... [id=eks-cluster-role]
module.kubernetes.aws_vpc.main: Refreshing state... [id=vpc-08c4330d865dc7409]
module.infrastructure.aws_iam_user.github: Refreshing state... [id=foreign-language-reader-github]
module.infrastructure.module.content.aws_iam_user.github: Refreshing state... [id=github-spark-deploy]
module.infrastructure.module.content.aws_s3_bucket.content: Refreshing state... [id=fluentlabs-content]
module.infrastructure.module.content.aws_iam_user.spark: Refreshing state... [id=spark]
module.infrastructure.module.database.aws_db_instance.fluentlabs: Refreshing state... [id=fluentlabs]
module.kubernetes.aws_iam_role.service_workers: Refreshing state... [id=eks-node-group-service]
module.infrastructure.module.content.aws_iam_access_key.github: Refreshing state... [id=AKIASM4ZEOVSERLYTV5P]
module.infrastructure.aws_iam_access_key.github: Refreshing state... [id=AKIASM4ZEOVSADUQ77GK]
module.infrastructure.module.content.aws_iam_access_key.spark: Refreshing state... [id=AKIASM4ZEOVSEBHLP4HO]
module.kubernetes.aws_iam_role_policy_attachment.eks_vpc_controller: Refreshing state... [id=eks-cluster-role-20210718103605121000000002]
module.infrastructure.module.frontend_fluent_labs.aws_s3_bucket.main: Refreshing state... [id=www.fluentlabs.io]
module.kubernetes.aws_iam_role_policy_attachment.eks_cluster_policy: Refreshing state... [id=eks-cluster-role-20210718103605118700000001]
module.infrastructure.module.frontend_preprod_fluent_labs.aws_s3_bucket.main: Refreshing state... [id=preprod.fluentlabs.io]
module.kubernetes.aws_iam_role_policy_attachment.eks_cni_policy_worker: Refreshing state... [id=eks-node-group-service-20210718103029423400000002]
module.kubernetes.aws_iam_role_policy_attachment.eks_container_read_policy: Refreshing state... [id=eks-node-group-service-20210718215214601100000001]
module.kubernetes.aws_iam_role_policy_attachment.eks_worker_node_policy: Refreshing state... [id=eks-node-group-service-20210718103029414600000001]
module.infrastructure.module.api.kubernetes_secret.elasticsearch_credentials: Refreshing state... [id=default/elasticsearch-credentials]
module.infrastructure.module.nginx_ingress.kubernetes_secret.nginx_certificate: Refreshing state... [id=default/nginx-certificate]
module.infrastructure.module.language_service.kubernetes_horizontal_pod_autoscaler.language_service_autoscale: Refreshing state... [id=default/language-service]
module.infrastructure.module.api.kubernetes_secret.application-secret: Refreshing state... [id=default/application-secret]
module.infrastructure.module.content.kubernetes_secret.spark_config: Refreshing state... [id=default/spark-config]
module.infrastructure.module.api.kubernetes_service.api: Refreshing state... [id=default/api]
module.infrastructure.module.nginx_ingress.kubernetes_ingress.ingress: Refreshing state... [id=default/fluentlabs-ingress]
module.infrastructure.module.api.kubernetes_secret.api_database_credentials: Refreshing state... [id=default/api-database-credentials]
module.infrastructure.module.language_service.kubernetes_service.language_service: Refreshing state... [id=default/language-service]
module.infrastructure.module.api.kubernetes_horizontal_pod_autoscaler.api_autoscale: Refreshing state... [id=default/api]
module.infrastructure.module.language_service.kubernetes_deployment.language_service: Refreshing state... [id=default/language-service]
module.infrastructure.module.monitoring.helm_release.sematext_logagent: Refreshing state... [id=sematext]
module.infrastructure.module.monitoring.helm_release.prometheus_operator: Refreshing state... [id=prometheus]
module.infrastructure.module.content.helm_release.spark: Refreshing state... [id=spark]
module.infrastructure.module.nginx_ingress.helm_release.nginx_ingress: Refreshing state... [id=nginx-ingress]
module.infrastructure.module.monitoring.helm_release.fluentd_elasticsearch: Refreshing state... [id=fluentd]
module.infrastructure.module.api.kubernetes_deployment.api: Refreshing state... [id=default/api]
module.kubernetes.aws_internet_gateway.gateway: Refreshing state... [id=igw-072010f2418cb3795]
module.kubernetes.aws_subnet.public[0]: Refreshing state... [id=subnet-03d64ea688089e7e8]
module.kubernetes.aws_subnet.public[1]: Refreshing state... [id=subnet-0c64eade2a7db2bb4]
module.kubernetes.aws_subnet.public[2]: Refreshing state... [id=subnet-09bfc938045329b49]
module.kubernetes.aws_route_table.route_table: Refreshing state... [id=rtb-05eec23c01822e230]
module.kubernetes.aws_eks_cluster.fluentlabs: Refreshing state... [id=fluentlabsprod]
module.kubernetes.aws_eks_addon.coredns: Refreshing state... [id=fluentlabsprod:coredns]
module.kubernetes.aws_eks_node_group.jobs: Refreshing state... [id=fluentlabsprod:jobs]
module.kubernetes.aws_eks_addon.kube_proxy: Refreshing state... [id=fluentlabsprod:kube-proxy]
module.kubernetes.aws_eks_node_group.services: Refreshing state... [id=fluentlabsprod:services]
module.kubernetes.aws_eks_addon.vpc_cni: Refreshing state... [id=fluentlabsprod:vpc-cni]
module.infrastructure.module.frontend_fluent_labs.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=ERG8JFP6OLXF]
module.infrastructure.module.frontend_fluent_labs.aws_s3_bucket_policy.public_access: Refreshing state... [id=www.fluentlabs.io]
module.infrastructure.module.content.aws_iam_policy.spark_read: Refreshing state... [id=arn:aws:iam::165140526436:policy/spark-read-role]
module.infrastructure.module.content.aws_iam_policy.spark_write: Refreshing state... [id=arn:aws:iam::165140526436:policy/spark-write-role]
module.infrastructure.module.content.aws_iam_policy.deploy: Refreshing state... [id=arn:aws:iam::165140526436:policy/spark-deploy-role]
module.infrastructure.module.frontend_preprod_fluent_labs.aws_s3_bucket_policy.public_access: Refreshing state... [id=preprod.fluentlabs.io]
module.infrastructure.module.content.aws_iam_policy_attachment.spark_read: Refreshing state... [id=spark-read-role-attach]
module.infrastructure.module.content.aws_iam_policy_attachment.deploy: Refreshing state... [id=spark-deploy-role-attach]
module.infrastructure.module.content.aws_iam_policy_attachment.spark_write: Refreshing state... [id=spark-write-role-attach]
module.infrastructure.module.frontend_preprod_fluent_labs.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E32KMXMEZQQYJK]
module.infrastructure.module.frontend_fluent_labs.aws_iam_policy.deploy: Refreshing state... [id=arn:aws:iam::165140526436:policy/www.fluentlabs.io-deploy-role]
module.infrastructure.module.frontend_fluent_labs.aws_iam_policy_attachment.deploy: Refreshing state... [id=www.fluentlabs.io-deploy-role-attach]
module.infrastructure.module.frontend_preprod_fluent_labs.aws_iam_policy.deploy: Refreshing state... [id=arn:aws:iam::165140526436:policy/preprod.fluentlabs.io-deploy-role]
module.infrastructure.module.frontend_preprod_fluent_labs.aws_iam_policy_attachment.deploy: Refreshing state... [id=preprod.fluentlabs.io-deploy-role-attach]
module.infrastructure.module.nginx_ingress.aws_route53_record.subdomain["api"]: Refreshing state... [id=Z06930519E1ERX06IWP1_api.fluentlabs.io_CNAME]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.infrastructure.acme_certificate.certificate will be destroyed
  - resource "acme_certificate" "certificate" {
      - account_key_pem              = (sensitive value)
      - certificate_domain           = "*.foreignlanguagereader.com" -> null
      - certificate_p12              = (sensitive value)
      - certificate_pem              = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIFPjCCBCagAwIBAgISAzOYuN6713eTdEnQiNPspfirMA0GCSqGSIb3DQEBCwUA
            MDIxCzAJBgNVBAYTAlVTMRYwFAYDVQQKEw1MZXQncyBFbmNyeXB0MQswCQYDVQQD
            EwJSMzAeFw0yMTA3MjUyMDU3MTNaFw0yMTEwMjMyMDU3MTFaMCYxJDAiBgNVBAMM
            GyouZm9yZWlnbmxhbmd1YWdlcmVhZGVyLmNvbTCCASIwDQYJKoZIhvcNAQEBBQAD
            ggEPADCCAQoCggEBAOJeP5miwkqKVFZTEL75JU+4qc/KECQ3+HdNTCD16DnOQi1n
            qdC/8CJmpD/3OY+dDbzgjPeYDUAHb9YLXaOc0Rewo7gFRygks5CTSUbgy5cLseCw
            NSLckVB3rrt2q9V+cBQHUyltIm/6LC2xXLFDi5KVPx++N0qhvPbPefG5nWq/VpWC
            hq5c6kpI80Wez0EL+9pBODwtU1wHx21q3Ys2KtLo/5ihUR9aRMaTUlRxiv6igleH
            bFVSbX9RYDNIMpiNMFUMkMFEkH55T6aIPZGhILRS/no4oToXRjJlr9b686yws/dS
            n2iHCT37eRFesz9u3kD9ZRUdE1Gzn4oYGlqZkycCAwEAAaOCAlgwggJUMA4GA1Ud
            DwEB/wQEAwIFoDAdBgNVHSUEFjAUBggrBgEFBQcDAQYIKwYBBQUHAwIwDAYDVR0T
            AQH/BAIwADAdBgNVHQ4EFgQUlaRsI3FHN3cg5QGlKwgF2thizlswHwYDVR0jBBgw
            FoAUFC6zF7dYVsuuUAlA5h+vnYsUwsYwVQYIKwYBBQUHAQEESTBHMCEGCCsGAQUF
            BzABhhVodHRwOi8vcjMuby5sZW5jci5vcmcwIgYIKwYBBQUHMAKGFmh0dHA6Ly9y
            My5pLmxlbmNyLm9yZy8wJgYDVR0RBB8wHYIbKi5mb3JlaWdubGFuZ3VhZ2VyZWFk
            ZXIuY29tMEwGA1UdIARFMEMwCAYGZ4EMAQIBMDcGCysGAQQBgt8TAQEBMCgwJgYI
            KwYBBQUHAgEWGmh0dHA6Ly9jcHMubGV0c2VuY3J5cHQub3JnMIIBBgYKKwYBBAHW
            eQIEAgSB9wSB9ADyAHcAXNxDkv7mq0VEsV6a1FbmEDf71fpH3KFzlLJe5vbHDsoA
            AAF636wQTAAABAMASDBGAiEAl6eS3U530xikmtSwuki/yKQSxhBZcITsJ5D7B1wG
            9wYCIQCZQL9H3YDYpDgbyHUKvgkoI4P5+2zj7D0Qzuv/nHPHFwB3APZclC/RdzAi
            FFQYCDCUVo7jTRMZM7/fDC8gC8xO8WTjAAABet+sEEgAAAQDAEgwRgIhAKNIdZxu
            pNcEd3JhxkKHyy5rN+sUDXKb6e0CtkQNQuTZAiEAy94NFs+qhs1FiLWpuTxwng6h
            Uvcb4vuAyA7CKkTVEZYwDQYJKoZIhvcNAQELBQADggEBAI/oV/ZxOTrG+6CPb0mF
            oR4PM8Fb67y3oheVA6Z/37QaBZ6t/2Er+aOWgbmX3FRrClKK72bprmJYDiZi65nF
            rrBSn+f2bO3JxaFr17ypN7/GGpsMKkRu6IfVfoel7hfMPFSNpld66MiH1cpe8mNf
            r7Fh7tbFw4A5nCtaWEEtpMfpGD2NA6YoO1csV59KV2dXp2Uxye6UmRRtAqzvMgt9
            vz5fgjMwNbTmUfk7UJOnE5+wUp3yl18TVk3qtUpsOA8exseIX//vfHvcZS7sCbVh
            oZXrCT2Rcc+2HMNFN0QWdO8V/6xx2aIJ0TCxY+nrt/Ixj2AHLXra9uFnIwHfZBBE
            FC4=
            -----END CERTIFICATE-----
        EOT -> null
      - certificate_url              = "https://acme-v02.api.letsencrypt.org/acme/cert/033398b8debbd777937449d088d3eca5f8ab" -> null
      - common_name                  = "*.foreignlanguagereader.com" -> null
      - disable_complete_propagation = false -> null
      - id                           = "5b26b697-bd46-8986-882e-8d464a869dcd" -> null
      - issuer_pem                   = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIFFjCCAv6gAwIBAgIRAJErCErPDBinU/bWLiWnX1owDQYJKoZIhvcNAQELBQAw
            TzELMAkGA1UEBhMCVVMxKTAnBgNVBAoTIEludGVybmV0IFNlY3VyaXR5IFJlc2Vh
            cmNoIEdyb3VwMRUwEwYDVQQDEwxJU1JHIFJvb3QgWDEwHhcNMjAwOTA0MDAwMDAw
            WhcNMjUwOTE1MTYwMDAwWjAyMQswCQYDVQQGEwJVUzEWMBQGA1UEChMNTGV0J3Mg
            RW5jcnlwdDELMAkGA1UEAxMCUjMwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEK
            AoIBAQC7AhUozPaglNMPEuyNVZLD+ILxmaZ6QoinXSaqtSu5xUyxr45r+XXIo9cP
            R5QUVTVXjJ6oojkZ9YI8QqlObvU7wy7bjcCwXPNZOOftz2nwWgsbvsCUJCWH+jdx
            sxPnHKzhm+/b5DtFUkWWqcFTzjTIUu61ru2P3mBw4qVUq7ZtDpelQDRrK9O8Zutm
            NHz6a4uPVymZ+DAXXbpyb/uBxa3Shlg9F8fnCbvxK/eG3MHacV3URuPMrSXBiLxg
            Z3Vms/EY96Jc5lP/Ooi2R6X/ExjqmAl3P51T+c8B5fWmcBcUr2Ok/5mzk53cU6cG
            /kiFHaFpriV1uxPMUgP17VGhi9sVAgMBAAGjggEIMIIBBDAOBgNVHQ8BAf8EBAMC
            AYYwHQYDVR0lBBYwFAYIKwYBBQUHAwIGCCsGAQUFBwMBMBIGA1UdEwEB/wQIMAYB
            Af8CAQAwHQYDVR0OBBYEFBQusxe3WFbLrlAJQOYfr52LFMLGMB8GA1UdIwQYMBaA
            FHm0WeZ7tuXkAXOACIjIGlj26ZtuMDIGCCsGAQUFBwEBBCYwJDAiBggrBgEFBQcw
            AoYWaHR0cDovL3gxLmkubGVuY3Iub3JnLzAnBgNVHR8EIDAeMBygGqAYhhZodHRw
            Oi8veDEuYy5sZW5jci5vcmcvMCIGA1UdIAQbMBkwCAYGZ4EMAQIBMA0GCysGAQQB
            gt8TAQEBMA0GCSqGSIb3DQEBCwUAA4ICAQCFyk5HPqP3hUSFvNVneLKYY611TR6W
            PTNlclQtgaDqw+34IL9fzLdwALduO/ZelN7kIJ+m74uyA+eitRY8kc607TkC53wl
            ikfmZW4/RvTZ8M6UK+5UzhK8jCdLuMGYL6KvzXGRSgi3yLgjewQtCPkIVz6D2QQz
            CkcheAmCJ8MqyJu5zlzyZMjAvnnAT45tRAxekrsu94sQ4egdRCnbWSDtY7kh+BIm
            lJNXoB1lBMEKIq4QDUOXoRgffuDghje1WrG9ML+Hbisq/yFOGwXD9RiX8F6sw6W4
            avAuvDszue5L3sz85K+EC4Y/wFVDNvZo4TYXao6Z0f+lQKc0t8DQYzk1OXVu8rp2
            yJMC6alLbBfODALZvYH7n7do1AZls4I9d1P4jnkDrQoxB3UqQ9hVl3LEKQ73xF1O
            yK5GhDDX8oVfGKF5u+decIsH4YaTw7mP3GFxJSqv3+0lUFJoi5Lc5da149p90Ids
            hCExroL1+7mryIkXPeFM5TgO9r0rvZaBFOvV2z0gp35Z0+L4WPlbuEjN/lxPFin+
            HlUjr8gRsI3qfJOQFy/9rKIJR0Y/8Omwt/8oTWgy1mdeHmmjk7j1nYsvC9JSQ6Zv
            MldlTTKB3zhThV1+XWYp6rjd5JW1zbVWEkLNxE7GJThEUG3szgBVGP7pSWTUTsqX
            nLRbwHOoq7hHwg==
            -----END CERTIFICATE-----
            -----BEGIN CERTIFICATE-----
            MIIFYDCCBEigAwIBAgIQQAF3ITfU6UK47naqPGQKtzANBgkqhkiG9w0BAQsFADA/
            MSQwIgYDVQQKExtEaWdpdGFsIFNpZ25hdHVyZSBUcnVzdCBDby4xFzAVBgNVBAMT
            DkRTVCBSb290IENBIFgzMB4XDTIxMDEyMDE5MTQwM1oXDTI0MDkzMDE4MTQwM1ow
            TzELMAkGA1UEBhMCVVMxKTAnBgNVBAoTIEludGVybmV0IFNlY3VyaXR5IFJlc2Vh
            cmNoIEdyb3VwMRUwEwYDVQQDEwxJU1JHIFJvb3QgWDEwggIiMA0GCSqGSIb3DQEB
            AQUAA4ICDwAwggIKAoICAQCt6CRz9BQ385ueK1coHIe+3LffOJCMbjzmV6B493XC
            ov71am72AE8o295ohmxEk7axY/0UEmu/H9LqMZshftEzPLpI9d1537O4/xLxIZpL
            wYqGcWlKZmZsj348cL+tKSIG8+TA5oCu4kuPt5l+lAOf00eXfJlII1PoOK5PCm+D
            LtFJV4yAdLbaL9A4jXsDcCEbdfIwPPqPrt3aY6vrFk/CjhFLfs8L6P+1dy70sntK
            4EwSJQxwjQMpoOFTJOwT2e4ZvxCzSow/iaNhUd6shweU9GNx7C7ib1uYgeGJXDR5
            bHbvO5BieebbpJovJsXQEOEO3tkQjhb7t/eo98flAgeYjzYIlefiN5YNNnWe+w5y
            sR2bvAP5SQXYgd0FtCrWQemsAXaVCg/Y39W9Eh81LygXbNKYwagJZHduRze6zqxZ
            Xmidf3LWicUGQSk+WT7dJvUkyRGnWqNMQB9GoZm1pzpRboY7nn1ypxIFeFntPlF4
            FQsDj43QLwWyPntKHEtzBRL8xurgUBN8Q5N0s8p0544fAQjQMNRbcTa0B7rBMDBc
            SLeCO5imfWCKoqMpgsy6vYMEG6KDA0Gh1gXxG8K28Kh8hjtGqEgqiNx2mna/H2ql
            PRmP6zjzZN7IKw0KKP/32+IVQtQi0Cdd4Xn+GOdwiK1O5tmLOsbdJ1Fu/7xk9TND
            TwIDAQABo4IBRjCCAUIwDwYDVR0TAQH/BAUwAwEB/zAOBgNVHQ8BAf8EBAMCAQYw
            SwYIKwYBBQUHAQEEPzA9MDsGCCsGAQUFBzAChi9odHRwOi8vYXBwcy5pZGVudHJ1
            c3QuY29tL3Jvb3RzL2RzdHJvb3RjYXgzLnA3YzAfBgNVHSMEGDAWgBTEp7Gkeyxx
            +tvhS5B1/8QVYIWJEDBUBgNVHSAETTBLMAgGBmeBDAECATA/BgsrBgEEAYLfEwEB
            ATAwMC4GCCsGAQUFBwIBFiJodHRwOi8vY3BzLnJvb3QteDEubGV0c2VuY3J5cHQu
            b3JnMDwGA1UdHwQ1MDMwMaAvoC2GK2h0dHA6Ly9jcmwuaWRlbnRydXN0LmNvbS9E
            U1RST09UQ0FYM0NSTC5jcmwwHQYDVR0OBBYEFHm0WeZ7tuXkAXOACIjIGlj26Ztu
            MA0GCSqGSIb3DQEBCwUAA4IBAQAKcwBslm7/DlLQrt2M51oGrS+o44+/yQoDFVDC
            5WxCu2+b9LRPwkSICHXM6webFGJueN7sJ7o5XPWioW5WlHAQU7G75K/QosMrAdSW
            9MUgNTP52GE24HGNtLi1qoJFlcDyqSMo59ahy2cI2qBDLKobkx/J3vWraV0T9VuG
            WCLKTVXkcGdtwlfFRjlBz4pYg1htmf5X6DYO8A4jqv2Il9DjXA6USbW1FzXSLr9O
            he8Y4IWS6wY7bCkjCWDcRQJMEhg76fsO3txE+FiYruq9RUWhiF1myv4Q6W+CyBFC
            Dfvp7OOGAN6dEOM4+qR9sdjoSYKEBpsr6GtPAQw4dy753ec5
            -----END CERTIFICATE-----
        EOT -> null
      - key_type                     = "2048" -> null
      - min_days_remaining           = 30 -> null
      - must_staple                  = false -> null
      - pre_check_delay              = 0 -> null
      - private_key_pem              = (sensitive value)

      - dns_challenge {
          - config   = (sensitive value)
          - provider = "digitalocean" -> null
        }
    }

  # module.infrastructure.acme_certificate.certificate_fluent_labs will be updated in-place
  ~ resource "acme_certificate" "certificate_fluent_labs" {
        id                           = "1f925157-0a72-7ffc-0dc5-688f3f39570f"
        # (13 unchanged attributes hidden)

      ~ dns_challenge {
          ~ config   = (sensitive value)
          ~ provider = "digitalocean" -> "route53"
        }
    }

  # module.infrastructure.aws_route53_zone.main will be created
  + resource "aws_route53_zone" "main" {
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "fluentlabs.io"
      + name_servers  = (known after apply)
      + tags_all      = (known after apply)
      + zone_id       = (known after apply)
    }

  # module.infrastructure.digitalocean_domain.fluentlabs will be destroyed
  - resource "digitalocean_domain" "fluentlabs" {
      - id   = "fluentlabs.io" -> null
      - name = "fluentlabs.io" -> null
      - urn  = "do:domain:fluentlabs.io" -> null
    }

  # module.infrastructure.digitalocean_domain.main will be destroyed
  - resource "digitalocean_domain" "main" {
      - id   = "foreignlanguagereader.com" -> null
      - name = "foreignlanguagereader.com" -> null
      - urn  = "do:domain:foreignlanguagereader.com" -> null
    }

  # module.infrastructure.module.api.kubernetes_deployment.api is tainted, so must be replaced
-/+ resource "kubernetes_deployment" "api" {
      ~ id               = "default/api" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 1 -> (known after apply)
          - labels           = {} -> null
            name             = "api"
          ~ resource_version = "951840" -> (known after apply)
          + self_link        = (known after apply)
          ~ uid              = "bc70cb6a-b49e-4d2e-aa10-52251b17ab86" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ spec {
          ~ replicas                  = "1" -> (known after apply)
            # (4 unchanged attributes hidden)


          ~ strategy {
              ~ type = "RollingUpdate" -> (known after apply)

              ~ rolling_update {
                  ~ max_surge       = "25%" -> (known after apply)
                  ~ max_unavailable = "25%" -> (known after apply)
                }
            }

          ~ template {
              ~ metadata {
                  - annotations      = {} -> null
                  ~ generation       = 0 -> (known after apply)
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + self_link        = (known after apply)
                  + uid              = (known after apply)
                    # (1 unchanged attribute hidden)
                }

              ~ spec {
                  - active_deadline_seconds          = 0 -> null
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  - node_selector                    = {} -> null
                  + service_account_name             = (known after apply)
                    # (9 unchanged attributes hidden)

                  ~ container {
                      - args                       = [] -> null
                      - command                    = [] -> null
                      ~ image_pull_policy          = "IfNotPresent" -> (known after apply)
                        name                       = "api"
                      ~ termination_message_policy = "File" -> (known after apply)
                        # (5 unchanged attributes hidden)

                      ~ env {
                            name = "APPLICATION_SECRET"

                          ~ value_from {

                              ~ secret_key_ref {
                                    name     = "application-secret"
                                  - optional = false -> null
                                    # (1 unchanged attribute hidden)
                                }
                            }
                        }
                      ~ env {
                            name = "WEBSTER_LEARNERS_KEY"

                          ~ value_from {

                              ~ secret_key_ref {
                                    name     = "webster"
                                  - optional = false -> null
                                    # (1 unchanged attribute hidden)
                                }
                            }
                        }
                      ~ env {
                            name = "WEBSTER_SPANISH_KEY"

                          ~ value_from {

                              ~ secret_key_ref {
                                    name     = "webster"
                                  - optional = false -> null
                                    # (1 unchanged attribute hidden)
                                }
                            }
                        }
                      ~ env {
                            name = "ELASTICSEARCH_PASSWORD"

                          ~ value_from {

                              ~ secret_key_ref {
                                    name     = "elasticsearch-credentials"
                                  - optional = false -> null
                                    # (1 unchanged attribute hidden)
                                }
                            }
                        }
                      ~ env {
                            name = "DATABASE_URL"

                          ~ value_from {

                              ~ secret_key_ref {
                                    name     = "api-database-credentials"
                                  - optional = false -> null
                                    # (1 unchanged attribute hidden)
                                }
                            }
                        }
                      ~ env {
                            name = "DATABASE_USERNAME"

                          ~ value_from {

                              ~ secret_key_ref {
                                    name     = "api-database-credentials"
                                  - optional = false -> null
                                    # (1 unchanged attribute hidden)
                                }
                            }
                        }
                      ~ env {
                            name = "DATABASE_PASSWORD"

                          ~ value_from {

                              ~ secret_key_ref {
                                    name     = "api-database-credentials"
                                  - optional = false -> null
                                    # (1 unchanged attribute hidden)
                                }
                            }
                        }
                      ~ env {
                            name = "AUTH0_AUDIENCE"

                          ~ value_from {

                              ~ secret_key_ref {
                                    name     = "auth0"
                                  - optional = false -> null
                                    # (1 unchanged attribute hidden)
                                }
                            }
                        }
                      ~ env {
                            name = "AUTH0_DOMAIN"

                          ~ value_from {

                              ~ secret_key_ref {
                                    name     = "auth0"
                                  - optional = false -> null
                                    # (1 unchanged attribute hidden)
                                }
                            }
                        }

                      ~ liveness_probe {
                            # (5 unchanged attributes hidden)

                          ~ http_get {
                                # (3 unchanged attributes hidden)
                            }
                        }

                      ~ port {
                          - host_port      = 0 -> null
                            # (2 unchanged attributes hidden)
                        }

                      ~ readiness_probe {
                            # (5 unchanged attributes hidden)

                          ~ http_get {
                                # (3 unchanged attributes hidden)
                            }
                        }


                      ~ volume_mount {
                            name              = "flrcredentials"
                            # (3 unchanged attributes hidden)
                        }
                        # (3 unchanged blocks hidden)
                    }

                  + image_pull_secrets {
                      + name = (known after apply)
                    }

                  + readiness_gate {
                      + condition_type = (known after apply)
                    }

                  ~ volume {
                        name = "flrcredentials"

                      ~ secret {
                          - optional     = false -> null
                            # (2 unchanged attributes hidden)
                        }
                    }
                }
            }
            # (1 unchanged block hidden)
        }
    }

  # module.infrastructure.module.frontend_fluent_labs.data.aws_iam_policy_document.deploy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "deploy"  {
      ~ id      = "3225798092" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:PutBucketWebsite",
                          - "s3:ListBucketMultipartUploads",
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:GetBucketLocation",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::www.fluentlabs.io/*",
                          - "arn:aws:s3:::www.fluentlabs.io",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "cloudfront:CreateInvalidation"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cloudfront::165140526436:distribution/ERG8JFP6OLXF"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # module.infrastructure.module.frontend_fluent_labs.aws_iam_policy.deploy will be updated in-place
  ~ resource "aws_iam_policy" "deploy" {
        id          = "arn:aws:iam::165140526436:policy/www.fluentlabs.io-deploy-role"
        name        = "www.fluentlabs.io-deploy-role"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:PutBucketWebsite",
                          - "s3:ListBucketMultipartUploads",
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:GetBucketLocation",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::www.fluentlabs.io/*",
                          - "arn:aws:s3:::www.fluentlabs.io",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "cloudfront:CreateInvalidation"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cloudfront::165140526436:distribution/ERG8JFP6OLXF"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {}
        # (5 unchanged attributes hidden)
    }

  # module.infrastructure.module.frontend_fluent_labs.aws_route53_record.subdomain will be created
  + resource "aws_route53_record" "subdomain" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www.fluentlabs.io"
      + records         = [
          + "d2xya4qmgcihii.cloudfront.net",
        ]
      + ttl             = 3600
      + type            = "CNAME"
      + zone_id         = "Z06930519E1ERX06IWP1"
    }

  # module.infrastructure.module.frontend_preprod_fluent_labs.data.aws_iam_policy_document.deploy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "deploy"  {
      ~ id      = "3275922508" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:PutBucketWebsite",
                          - "s3:ListBucketMultipartUploads",
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:GetBucketLocation",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::preprod.fluentlabs.io/*",
                          - "arn:aws:s3:::preprod.fluentlabs.io",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "cloudfront:CreateInvalidation"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cloudfront::165140526436:distribution/E32KMXMEZQQYJK"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # module.infrastructure.module.frontend_preprod_fluent_labs.aws_iam_policy.deploy will be updated in-place
  ~ resource "aws_iam_policy" "deploy" {
        id          = "arn:aws:iam::165140526436:policy/preprod.fluentlabs.io-deploy-role"
        name        = "preprod.fluentlabs.io-deploy-role"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:PutBucketWebsite",
                          - "s3:ListBucketMultipartUploads",
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:GetBucketLocation",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::preprod.fluentlabs.io/*",
                          - "arn:aws:s3:::preprod.fluentlabs.io",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "cloudfront:CreateInvalidation"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cloudfront::165140526436:distribution/E32KMXMEZQQYJK"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {}
        # (5 unchanged attributes hidden)
    }

  # module.infrastructure.module.frontend_preprod_fluent_labs.aws_route53_record.subdomain will be created
  + resource "aws_route53_record" "subdomain" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "preprod.fluentlabs.io"
      + records         = [
          + "d345u8ud0yxnv1.cloudfront.net",
        ]
      + ttl             = 3600
      + type            = "CNAME"
      + zone_id         = "Z06930519E1ERX06IWP1"
    }

  # module.infrastructure.module.nginx_ingress.aws_route53_zone.main will be destroyed
  - resource "aws_route53_zone" "main" {
      - comment       = "Managed by Terraform" -> null
      - force_destroy = false -> null
      - id            = "Z06930519E1ERX06IWP1" -> null
      - name          = "fluentlabs.io" -> null
      - name_servers  = [
          - "ns-1432.awsdns-51.org",
          - "ns-1549.awsdns-01.co.uk",
          - "ns-596.awsdns-10.net",
          - "ns-76.awsdns-09.com",
        ] -> null
      - tags          = {} -> null
      - tags_all      = {} -> null
      - zone_id       = "Z06930519E1ERX06IWP1" -> null
    }

Plan: 4 to add, 3 to change, 5 to destroy.
```

</details>

*Workflow: `Test infrastructure plan`, Action: `__hashicorp_terraform-github-actions_4`, Working Directory: `.`, Workspace: `default`*
